cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils'
brew 'node'
brew 'shellcheck'
brew 'unrar'
brew 'wget'
brew 'zsh'

#cask '1password'
cask 'adium'
cask 'atom'
cask 'firefox'
cask 'flash'
cask 'flux'
cask 'github-desktop'
cask 'google-chrome'
cask 'iterm2-beta'
cask 'sourcetree'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
# quicklook plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
