cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'

brew 'ack'
brew 'arping'
brew 'ansible'
brew 'awscli'
brew 'coreutils'
brew 'fasd'
brew 'fping'
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'hachoir-metadata'
brew 'jq'
brew 'mas'
brew 'mercurial'
brew 'node'
brew 'pv'
brew 'python'
brew 'qemu'
brew 'ssh-copy-id'
brew 'svn'
brew 'syncthing'
brew 'the_silver_searcher'
brew 'tmux'
brew 'unrar'
brew 'wget'
brew 'zsh'

# Linters
brew 'shellcheck'
brew 'shfmt'


cask 'xquartz'

#cask '1password'
#cask 'adium'
cask 'alfred'
cask 'atom'
cask 'beardedspice'
cask 'caffeine'
cask 'cord'
#cask 'dia'
cask 'font-fira-sans'
cask 'font-fira-code'
cask 'firefox'
cask 'flash-npapi'
cask 'flux'
cask 'github-desktop'
cask 'google-chrome'
cask 'gpg-suite'
cask 'hammerspoon'
cask 'inkscape'
cask 'iterm2'
cask 'libreoffice'
cask 'mattermost'
cask 'slack'
cask 'sourcetree'
cask 'the-unarchiver'
cask 'trim-enabler'
cask 'tunnelblick'
#cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
# quicklook plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'

cask 'osxfuse'
cask 'sshfs'

cask 'unison'

